TransportManagementDevelop_KAT/Конфигурация/src/Reports/гкс_НаличиеВнешнейПробы/гкс_НаличиеВнешнейПробы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>гкс_НаличиеВнешнейПробы</name>
</mdclass:Report>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СвязьРегистрацииИТранспортногоДокумента/гкс_СвязьРегистрацииИТранспортногоДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СвязьРегистрацииИТранспортногоДокумента</name>
  <comment>Транспортные документы регистрации</comment>
  <resources>
    <name>ТранспортныйДокумент</name>
    <type>
      <types>DocumentRef.гкс_ТранспортныйДокумент</types>
    </type>
  </resources>
  <resources>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>ЗаявкаНаПеревозку</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипРегистрации/гкс_ТипРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипРегистрации</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_РегистрацияНаПЛК/гкс_РегистрацияНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_РегистрацияНаПЛК</name>
  <basedOn>Document.гкс_ВъездНаКПП</basedOn>
  <registerRecords>AccumulationRegister.гкс_СДИЗНаПЛК</registerRecords>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>DocumentRef.гкс_СпецификацияКДоговоруКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПолучатель</name>
    <comment>Для приёмки Грузоотправитель, для отправки Грузополучатель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаПоставщика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Внутригрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Собственник</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаВъезда</name>
    <comment>Точка маршрута для определения проезда</comment>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ИДРейса</name>
    <comment>ERP-2176</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <comment>Ед.измерения веса в документе</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗоныКарантинногоКонтроля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗоныКарантинногоКонтроляСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесоваяВъезда</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПроезда</name>
    <type>
      <types>CatalogRef.гкс_УсловияПроезда</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПогрузки</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаОтгрузкуПродукции</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаОтгрузкуПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузкаСОдногоБорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.гкс_ПрибытиеСуднаНаПЛК</types>
      <types>DocumentRef.гкс_ЗаписьВОчередьПриемкиПЛК</types>
      <types>DocumentRef.гкс_ВъездНаКПП</types>
      <types>DocumentRef.гкс_СРПВПрибытиеНаПуть</types>
    </type>
  </attributes>
  <attributes>
    <name>СДИЗ</name>
    <type>
      <types>CatalogRef.гкс_СДИЗЗЕРНО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаОснования</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Reports/гкс_НаличиеВнешнейПробы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	СтруктураПараметров = Новый Структура;
	
	Для Каждого Параметр Из МакетКомпоновки.ЗначенияПараметров Цикл
		Если Параметр.Имя = "Период" Тогда
			СтруктураПараметров.Вставить("НачалоПериода", Параметр.Значение.ДатаНачала);
			СтруктураПараметров.Вставить("ОкончаниеПериода", Параметр.Значение.ДатаОкончания);
		Иначе
			СтруктураПараметров.Вставить(Параметр.Имя, Параметр.Значение);
		КонецЕсли;	
	КонецЦикла;
		
	ВнешнийНаборДанных = Новый Структура("ТаблицаДанных", ДанныеОтчета(СтруктураПараметров));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеОтчета(СтруктураПараметров)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегистрацияНаПЛК.Ссылка КАК Регистрация,
		|	СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	СвязьРегистрацииИТранспортногоДокумента.ЗаявкаНаПеревозку КАК ЗаявкаНаПеревозку,
		|	РегистрацияНаПЛК.ТранспортноеСредство КАК Транспорт,
		|	РегистрацияНаПЛК.Номенклатура КАК Номенклатура,
		|	РегистрацияНаПЛК.ВидПеревозки КАК ВидПеревозки,
		|	РегистрацияНаПЛК.ТочкаМаршрута КАК ТочкаМаршрута
		|ИЗ
		|	Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК СвязьРегистрацииИТранспортногоДокумента
		|		ПО РегистрацияНаПЛК.Ссылка = СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации
		|ГДЕ
		|	РегистрацияНаПЛК.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И РегистрацияНаПЛК.Проведен
		|	И РегистрацияНаПЛК.ТипРегистрации = ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Приемка)";
	
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураПараметров.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", СтруктураПараметров.ОкончаниеПериода);
	
	Если СтруктураПараметров.Свойство("Номенклатура") Тогда
		Запрос.Текст = Запрос.Текст + "
		| И РегистрацияНаПЛК.Номенклатура В(&СписокНоменклатуры)";
		Запрос.УстановитьПараметр("СписокНоменклатуры", СтруктураПараметров.Номенклатура);
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("Транспорт") Тогда
		Запрос.Текст = Запрос.Текст + "
		| И РегистрацияНаПЛК.ТранспортноеСредство В(&СписокТС)";
		Запрос.УстановитьПараметр("СписокТС", СтруктураПараметров.Транспорт);
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("ТранспортныйДокумент") Тогда
		Запрос.Текст = Запрос.Текст + "
		| И СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент В(&СписокТранспортныйДокумент)";
		Запрос.УстановитьПараметр("СписокТранспортныйДокумент", СтруктураПараметров.ТранспортныйДокумент);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеЗапроса = РезультатЗапроса.Выгрузить();
	ДанныеЗапроса.Колонки.Добавить("ВнешняяПроба");
	ДанныеЗапроса.Колонки.Добавить("Показатель");
	ДанныеЗапроса.Колонки.Добавить("ЗначениеПоказателя");
	
	ИтоговаяТаблица = ДанныеЗапроса.СкопироватьКолонки();

	Для Каждого СтрокаДанных Из ДанныеЗапроса Цикл
		
        НоваяСтрока = ИтоговаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		
		ЗначенияВнешнейПробы = гкс_РаботаСПоказателямиНоменклатуры.ПоискДокументаВнешнейПробы(СтрокаДанных.Регистрация);		
		Если Не ЗначениеЗаполнено(ЗначенияВнешнейПробы) Тогда
			Продолжить;
		КонецЕсли;	
		
		НомерИтоговогоУзла = 0;
		ИтоговыйУзел = ЗначенияВнешнейПробы.Строки[НомерИтоговогоУзла];	
		
		Если ИтоговыйУзел.ЕстьВнешний Тогда 
			Сч = 0;
			Пока Сч < ИтоговыйУзел.Строки.Количество() Цикл
				ДанныеВнешнейПробы = ИтоговыйУзел.Строки[Сч]; 
				
				Если Сч > 0 Тогда
					НоваяСтрока = ИтоговаяТаблица.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
				КонецЕсли;
				
				НоваяСтрока.ВнешняяПроба = ДанныеВнешнейПробы.ВнешняяПроба;
				НоваяСтрока.Показатель = ДанныеВнешнейПробы.Показатель;
                НоваяСтрока.ЗначениеПоказателя = ДанныеВнешнейПробы.ЗначениеПоказателя;
				НоваяСтрока.ЗаявкаНаПеревозку = ДанныеВнешнейПробы.ЗаявкаНаПеревозку;
				
				Сч = Сч + 1;
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИтоговаяТаблица;
		
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
